DataProcessors/ИмпортЗначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ИмпортЗначений</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Catalogs/Аудитория.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Аудитория</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Места</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипАудитории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Преподаватель.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Преподаватель</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ИмпортЗначений/Forms/Аудитории/Ext/Form/Module.bsl
&НаСервере
Функция ЗаполнитьТаблицуАудиторий(Таблица)
	НепрочитанныеСтроки = Новый Массив();
	Для инд = 2 по Таблица.ВысотаТаблицы Цикл
		Попытка
			Наименование = Строка(Таблица.ПолучитьОбласть("R" + Формат(инд, "ЧГ=0;") + "C" + 1).ТекущаяОбласть.Текст);
			КолвоМест 	 = Число(Таблица.ПолучитьОбласть("R" + Формат(инд, "ЧГ=0;") + "C" + 2).ТекущаяОбласть.Текст);
			ТипНеобр 	 = Строка(Таблица.ПолучитьОбласть("R" + Формат(инд, "ЧГ=0;") + "C" + 3).ТекущаяОбласть.Текст);
			Попытка
				Тип = Перечисления.ТипАудитории[ТипНеобр];
			Исключение
				Тип = Перечисления.ТипАудитории.ПолучитьПредполагаемыйТип(ТипНеобр); 
			КонецПопытки;
			
			Данные = Аудитории.Добавить();
			Данные.Наименование = Наименование;
			Данные.КолвоМест = КолвоМест;
			Данные.Тип = Тип;
		Исключение     
			НепрочитанныеСтроки.Добавить(инд);
		КонецПопытки;	
	КонецЦикла; 
	Возврат НепрочитанныеСтроки; 
КонецФункции 

&НаСервере
Функция ЗаполнитьТаблицуПреподавателей(Таблица)
	НепрочитанныеСтроки = Новый Массив();
	Для инд = 2 по Таблица.ВысотаТаблицы Цикл
		Попытка
			Фамилия  = Строка(Таблица.ПолучитьОбласть("R" + Формат(инд, "ЧГ=0;") + "C" + 1).ТекущаяОбласть.Текст);
			Имя 	 = Строка(Таблица.ПолучитьОбласть("R" + Формат(инд, "ЧГ=0;") + "C" + 2).ТекущаяОбласть.Текст);
			Отчество = Строка(Таблица.ПолучитьОбласть("R" + Формат(инд, "ЧГ=0;") + "C" + 3).ТекущаяОбласть.Текст);
			
			Данные = Преподаватели.Добавить();
			Данные.Фамилия = Фамилия;
			Данные.Имя = Имя;
			Данные.Отчество = Отчество;
		Исключение     
			НепрочитанныеСтроки.Добавить(инд);
		КонецПопытки;	
	КонецЦикла; 
	Возврат НепрочитанныеСтроки; 
КонецФункции

&НаСервере
Функция ЗаполнитьТаблицуИзФайла(ИмяФайла, ТипТаблицы)
	Результат = Новый Структура;
	Результат.Вставить("Выполнено", Ложь);
	ТаблицаИмп = Новый ТабличныйДокумент();
	Попытка
		ТаблицаИмп.Прочитать(ИмяФайла);
	Исключение 
		Возврат Результат;
	КонецПопытки;
	
	Если СтрСравнить(ТипТаблицы, "Аудитории") = 0 Тогда
		Результат.Вставить("Ошибки", ЗаполнитьТаблицуАудиторий(ТаблицаИмп));
	ИначеЕсли СтрСравнить(ТипТаблицы, "Преподаватели") = 0 Тогда 
		Результат.Вставить("Ошибки", ЗаполнитьТаблицуПреподавателей(ТаблицаИмп));
	КонецЕсли;
	Результат.Выполнено = Истина;
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ПереводФайлаВТаблицу(Таблица)
	ДВФ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
 	ДВФ.Фильтр = "Таблица|*.xls;*.xlsx";
	ДВФ.Заголовок = "Выберите файл";
	ДВФ.ИндексФильтра = 0;                
	
	Если ДВФ.Выбрать() Тогда
		Результат = ЗаполнитьТаблицуИзФайла(ДВФ.ПолноеИмяФайла, Таблица);
		Если Не Результат.Выполнено Тогда
			Предупреждение("Не удалось загрузить данные из файла");
		ИначеЕсли Результат.Ошибки.Количество() > 0 Тогда 
			Ошибка = "Не удалось загрузить следующие строки: ";
			Ошибка = Ошибка + СтрСоединить(Результат.Ошибки, ", ");
			Предупреждение(Ошибка);
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаАуд(Команда)
	Таблица = "Аудитории";
	Если Аудитории.Количество() > 0 Тогда
		ОчиститьТаблицу(Таблица);	
	КонецЕсли;
	ПереводФайлаВТаблицу(Таблица);	
КонецПроцедуры 

&НаКлиенте
Процедура ВыборФайлаПреп(Команда)
	Таблица = "Преподаватели";
	Если Преподаватели.Количество() > 0 Тогда
		ОчиститьТаблицу(Таблица);		
	КонецЕсли;
	ПереводФайлаВТаблицу(Таблица);	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТаблицу(Таблица)
	ТекстВопроса = "Очистить таблицу перед добавлением новых записей?";
	Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Если СтрСравнить(Таблица, "Аудитории") = 0 Тогда 
			Аудитории.Очистить();
		ИначеЕсли СтрСравнить(Таблица, "Преподаватели") Тогда
			Преподаватели.Очистить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВСАуд(Команда)
	Ошибки = ВыгрузитьВСАудСерв();
	Если Ошибки.Количество() > 0 Тогда
		Предупреждение("Следующие аудитории не удалось загрузить: " + СтрСоединить(Ошибки, ", "));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ВыгрузитьВСАудСерв()
	Ошибки = Новый Массив();
	Индекс = 0;
	Для сч = 0 По Аудитории.Количество() - 1 Цикл
		строка = Аудитории[Индекс];
		Попытка
			НоваяАудитория = Справочники.Аудитория.СоздатьЭлемент();
			НоваяАудитория.Наименование = строка.Наименование;
			НоваяАудитория.Места = строка.КолвоМест;
			НоваяАудитория.Тип = строка.Тип; 
			НоваяАудитория.Записать();
			Аудитории.Удалить(Индекс);
		Исключение  
			Индекс = Индекс + 1;
			Ошибки.Добавить(строка.Наименование);
		КонецПопытки;
	КонецЦикла; 
	Возврат Ошибки;
КонецФункции

&НаКлиенте
Процедура ВыгрузитьВСПреп(Команда)
	Ошибки = ВыгрузитьВСПрепСерв();
	Если Ошибки.Количество() > 0 Тогда
		Предупреждение("Следующих преподавателей не удалось загрузить: " + СтрСоединить(Ошибки, ", "));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ВыгрузитьВСПрепСерв() 
	Ошибки = Новый Массив();
	Индекс = 0;
	Для сч = 0 По Преподаватели.Количество() - 1 Цикл
		строка = Преподаватели[Индекс];
		Попытка
			НовыйПреподаватель = Справочники.Преподаватель.СоздатьЭлемент();
			НовыйПреподаватель.Имя = строка.Имя;
			НовыйПреподаватель.Фамилия = строка.Фамилия;
			НовыйПреподаватель.Отчество = строка.Отчество; 
			НовыйПреподаватель.Записать();
			Преподаватели.Удалить(Индекс);
		Исключение  
			Индекс = Индекс + 1;
			Ошибки.Добавить(строка.Наименование);
		КонецПопытки;
	КонецЦикла; 
	Возврат Ошибки;
КонецФункции
